<script setup>
import {inject, ref, watch} from "vue";
import {useRoute} from 'vue-router'
import router from "@/router/index.js";

const description = ref(null);
const user = ref(null);
const infos = ref(null);
const complication = ref(null);
const credits = ref(null);
const result = ref(null);
let domin = ref(true);

const route = useRoute();

const showStatus = inject("showStatus")

watch(() => route.name, (newName) => {
  switch (newName) {
    case "Welcome" :
      welcome()
      break;
    case "SignIn" :
      User()
      break;
    case "SignUp" :
      User()
      break;
    case "CompanyInfo" :
      companyInfo() ;
      domin.value = false ;
      break;
    case "Domain" :
      companyInfo() ;
      domin.value = true ;
      break;
    case "Questions" :
      questions()
      break;
    case "PayPage" :
      payPage()
      break;
    case "Result" :
      finalResult()
      break;
    case "Profile" :
      showStatus()
      break;
  }
})

function welcome() {
  description.value.classList.add("now")
  description.value.classList.remove("passed")

  user.value.classList.remove("now")
  user.value.classList.remove("passed")

  infos.value.classList.remove("now")
  infos.value.classList.remove("passed")

  complication.value.classList.remove("now")
  complication.value.classList.remove("passed")

  credits.value.classList.remove("now")
  credits.value.classList.remove("passed")

  result.value.classList.remove("now")
}

function User() {
  description.value.classList.add("passed")
  description.value.classList.remove("now")

  user.value.classList.add("now")
  user.value.classList.remove("passed")

  infos.value.classList.remove("now")
  infos.value.classList.remove("passed")

  complication.value.classList.remove("now")
  complication.value.classList.remove("passed")

  credits.value.classList.remove("now")
  credits.value.classList.remove("passed")

  result.value.classList.remove("now")
}

function companyInfo() {
  description.value.classList.add("passed")
  description.value.classList.remove("now")

  user.value.classList.add("passed")
  user.value.classList.remove("now")

  infos.value.classList.add("now")
  infos.value.classList.remove("passed")

  complication.value.classList.remove("now")
  complication.value.classList.remove("passed")

  credits.value.classList.remove("now")
  credits.value.classList.remove("passed")

  result.value.classList.remove("now")
}

function questions() {
  description.value.classList.add("passed")
  description.value.classList.remove("now")

  user.value.classList.add("passed")
  user.value.classList.remove("now")

  infos.value.classList.add("passed")
  infos.value.classList.remove("now")

  complication.value.classList.add("now")
  complication.value.classList.remove("passed")

  credits.value.classList.remove("now")
  credits.value.classList.remove("passed")

  result.value.classList.remove("now")
}

function payPage() {
  description.value.classList.add("passed")
  description.value.classList.remove("now")

  user.value.classList.add("passed")
  user.value.classList.remove("now")

  infos.value.classList.add("passed")
  infos.value.classList.remove("now")

  complication.value.classList.add("passed")
  complication.value.classList.remove("now")

  credits.value.classList.add("now")
  credits.value.classList.remove("passed")

  result.value.classList.remove("now")
}

function finalResult() {
  description.value.classList.add("passed")
  description.value.classList.remove("now")

  user.value.classList.add("passed")
  user.value.classList.remove("now")

  infos.value.classList.add("passed")
  infos.value.classList.remove("now")

  complication.value.classList.add("passed")
  complication.value.classList.remove("now")

  credits.value.classList.add("passed")
  credits.value.classList.remove("now")

  result.value.classList.add("now")
}
</script>

<template>
  <div class="main">
    <ul>
      <li class="" ref="description" @click="router.push('/')">
        <svg width="161" height="133" viewBox="0 0 161 133" fill="none"
             xmlns="http://www.w3.org/2000/svg">
          <path
            d="M79.0265 0C53.5521 0 32.4001 18.5245 28.2825 42.8504H10.2803C10.1052 42.8504 9.93717 42.7808 9.8133 42.6568C9.68944 42.5328 9.61985 42.3646 9.61985 42.1893V39.252C9.61976 39.0796 9.56863 38.9111 9.47292 38.7677C9.37721 38.6244 9.24121 38.5126 9.08209 38.4466C8.92297 38.3806 8.74788 38.3632 8.57891 38.3967C8.40994 38.4302 8.25468 38.5131 8.13273 38.6348L0.00111321 46.7752C-0.081421 46.8575 -0.146908 46.9553 -0.191592 47.063C-0.236276 47.1707 -0.259277 47.2862 -0.259277 47.4028C-0.259277 47.5194 -0.236276 47.6349 -0.191592 47.7426C-0.146908 47.8503 -0.081421 47.9481 0.00111321 48.0305L8.08152 56.1185C8.20745 56.2448 8.36796 56.3308 8.54274 56.3657C8.71752 56.4006 8.89871 56.3828 9.0634 56.3146C9.22809 56.2464 9.36886 56.1309 9.46791 55.9826C9.56697 55.8342 9.61984 55.6599 9.61985 55.4815V52.6163C9.61985 52.5295 9.63694 52.4436 9.67013 52.3633C9.70332 52.2831 9.75197 52.2103 9.8133 52.1489C9.87463 52.0875 9.94744 52.0388 10.0276 52.0056C10.1077 51.9723 10.1936 51.9552 10.2803 51.9552H32.5725C32.6239 51.9548 32.6751 51.9485 32.7251 51.9364H37.5324C37.5324 51.7973 37.5324 51.6582 37.5324 51.518C37.5324 28.5791 56.1094 9.98978 79.0213 9.98978C101.933 9.98978 120.515 28.5844 120.515 51.5232C120.515 74.4621 101.938 93.0514 79.0213 93.0514C57.8829 93.0514 40.4366 77.231 37.8564 56.7733H27.8206C30.451 82.7593 52.3722 103.036 79.0265 103.036C107.452 103.036 130.497 79.9706 130.497 51.5169C130.497 23.0633 107.453 0 79.0265 0Z"
            fill="url(#paint0_linear_0_1)"/>
          <path
            d="M79.2303 36.9211L70.4811 44.0257C69.0259 45.2038 68.7457 47.3243 69.8484 48.8376C71.0143 50.4507 73.283 50.7678 74.8466 49.5445L83.8218 42.5486C84.4545 42.0593 85.3583 42.168 85.8554 42.8024C86.3526 43.4367 86.2351 44.3429 85.6024 44.8413L83.7133 46.3093L96.2767 57.9086V40.7997H96.2135L95.861 40.5731L89.2991 36.3593C87.9162 35.4712 86.2983 35 84.6533 35C82.683 35 80.7668 35.6796 79.2303 36.9211ZM81.291 48.1942L76.6182 51.8371C73.7711 54.0664 69.6405 53.4864 67.5074 50.5503C65.5009 47.7864 66.0071 43.926 68.6553 41.7784L76.1753 35.6796C75.1268 35.2356 73.997 35.0091 72.8491 35.0091C71.1499 35 69.4959 35.5075 68.0769 36.4499L61.5692 40.7997V61.0985H64.118L72.3791 68.6561C74.1507 70.2782 76.8893 70.1514 78.5072 68.3752C79.0043 67.8224 79.3387 67.179 79.5105 66.5085L81.047 67.9221C82.8095 69.5442 85.5572 69.4264 87.175 67.6593C87.5818 67.2153 87.88 66.6988 88.0699 66.1641C89.8233 67.3422 92.2095 67.0975 93.6827 65.4845C95.3006 63.7174 95.1831 60.9625 93.4206 59.3404L81.291 48.1942ZM51.4461 40.7997C50.6508 40.7997 50 41.4521 50 42.2496V61.0985C50 62.7024 51.2925 63.9983 52.8923 63.9983H55.7846C57.3844 63.9983 58.6769 62.7024 58.6769 61.0985V40.7997H51.4461ZM54.3384 58.1986C54.722 58.1986 55.0898 58.3514 55.361 58.6233C55.6322 58.8952 55.7846 59.264 55.7846 59.6485C55.7846 60.0331 55.6322 60.4019 55.361 60.6738C55.0898 60.9457 54.722 61.0985 54.3384 61.0985C53.9549 61.0985 53.5871 60.9457 53.3159 60.6738C53.0447 60.4019 52.8923 60.0331 52.8923 59.6485C52.8923 59.264 53.0447 58.8952 53.3159 58.6233C53.5871 58.3514 53.9549 58.1986 54.3384 58.1986ZM99.169 40.7997V61.0985C99.169 62.7024 100.462 63.9983 102.061 63.9983H104.954C106.553 63.9983 107.846 62.7024 107.846 61.0985V42.2496C107.846 41.4521 107.195 40.7997 106.4 40.7997H99.169ZM102.061 59.6485C102.061 59.264 102.214 58.8952 102.485 58.6233C102.756 58.3514 103.124 58.1986 103.507 58.1986C103.891 58.1986 104.259 58.3514 104.53 58.6233C104.801 58.8952 104.954 59.264 104.954 59.6485C104.954 60.0331 104.801 60.4019 104.53 60.6738C104.259 60.9457 103.891 61.0985 103.507 61.0985C103.124 61.0985 102.756 60.9457 102.485 60.6738C102.214 60.4019 102.061 60.0331 102.061 59.6485Z"
            fill="url(#paint1_linear_0_1)"/>
          <defs>
            <linearGradient id="paint0_linear_0_1" x1="65.1188" y1="0" x2="65.1188" y2="103.036"
                            gradientUnits="userSpaceOnUse">
              <stop stop-color="#1F9F62"/>
              <stop offset="1" stop-color="#022739"/>
            </linearGradient>
            <linearGradient id="paint1_linear_0_1" x1="78.923" y1="35" x2="78.923" y2="69.7946"
                            gradientUnits="userSpaceOnUse">
              <stop stop-color="#1F9F62"/>
              <stop offset="1" stop-color="#022739"/>
            </linearGradient>
          </defs>
        </svg>

        <h4 ref="descriptionTitle">معرفی عارضه یاب</h4>
      </li>
      <li class="" ref="user" @click="router.push('/SignIn')">
        <svg width="161" height="133" viewBox="0 0 161 133" fill="none"
             xmlns="http://www.w3.org/2000/svg">
          <path
            d="M79.0265 0C53.5521 0 32.4001 18.5245 28.2825 42.8504H10.2803C10.1052 42.8504 9.93717 42.7808 9.8133 42.6568C9.68944 42.5328 9.61985 42.3646 9.61985 42.1893V39.252C9.61976 39.0796 9.56863 38.9111 9.47292 38.7677C9.37721 38.6244 9.24121 38.5126 9.08209 38.4466C8.92297 38.3806 8.74788 38.3632 8.57891 38.3967C8.40994 38.4302 8.25468 38.5131 8.13273 38.6348L0.00111321 46.7752C-0.081421 46.8575 -0.146908 46.9553 -0.191592 47.063C-0.236276 47.1707 -0.259277 47.2862 -0.259277 47.4028C-0.259277 47.5194 -0.236276 47.6349 -0.191592 47.7426C-0.146908 47.8503 -0.081421 47.9481 0.00111321 48.0305L8.08152 56.1185C8.20745 56.2448 8.36796 56.3308 8.54274 56.3657C8.71752 56.4006 8.89871 56.3828 9.0634 56.3146C9.22809 56.2464 9.36886 56.1309 9.46791 55.9826C9.56697 55.8342 9.61984 55.6599 9.61985 55.4815V52.6163C9.61985 52.5295 9.63694 52.4436 9.67013 52.3633C9.70332 52.2831 9.75197 52.2103 9.8133 52.1489C9.87463 52.0875 9.94744 52.0388 10.0276 52.0056C10.1077 51.9723 10.1936 51.9552 10.2803 51.9552H32.5725C32.6239 51.9548 32.6751 51.9485 32.7251 51.9364H37.5324C37.5324 51.7973 37.5324 51.6582 37.5324 51.518C37.5324 28.5791 56.1094 9.98978 79.0213 9.98978C101.933 9.98978 120.515 28.5844 120.515 51.5232C120.515 74.4621 101.938 93.0514 79.0213 93.0514C57.8829 93.0514 40.4366 77.231 37.8564 56.7733H27.8206C30.451 82.7593 52.3722 103.036 79.0265 103.036C107.452 103.036 130.497 79.9706 130.497 51.5169C130.497 23.0633 107.453 0 79.0265 0Z"
            fill="url(#paint0_linear_0_1)"/>
          <path
            d="M79.2948 50.6089C82.6736 50.6089 85.9141 49.2598 88.3032 46.8585C90.6924 44.4572 92.0347 41.2004 92.0347 37.8044C92.0347 34.4085 90.6924 31.1516 88.3032 28.7503C85.9141 26.349 82.6736 25 79.2948 25C75.916 25 72.6755 26.349 70.2863 28.7503C67.8971 31.1516 66.5549 34.4085 66.5549 37.8044C66.5549 41.2004 67.8971 44.4572 70.2863 46.8585C72.6755 49.2598 75.916 50.6089 79.2948 50.6089ZM74.7463 55.4105C64.9425 55.4105 57 63.3933 57 73.2467C57 74.8873 58.3238 76.2178 59.956 76.2178H98.6335C100.266 76.2178 101.59 74.8873 101.59 73.2467C101.59 63.3933 93.6471 55.4105 83.8433 55.4105H74.7463Z"
            fill="url(#paint1_linear_0_1)"/>
          <defs>
            <linearGradient id="paint0_linear_0_1" x1="65.1188" y1="0" x2="65.1188" y2="103.036"
                            gradientUnits="userSpaceOnUse">
              <stop stop-color="#1F9F62"/>
              <stop offset="1" stop-color="#022739"/>
            </linearGradient>
            <linearGradient id="paint1_linear_0_1" x1="79.2948" y1="25" x2="79.2948" y2="76.2178"
                            gradientUnits="userSpaceOnUse">
              <stop stop-color="#2FBA90"/>
              <stop offset="1" stop-color="#023050"/>
            </linearGradient>
          </defs>
        </svg>

        <h4 ref="userTitle">ثبت نام / ورود</h4>
      </li>
      <li class="" ref="infos" @click="router.push('/domains')">
        <svg width="161" height="133" viewBox="0 0 161 133" fill="none"
             xmlns="http://www.w3.org/2000/svg">
          <path
            d="M79.0265 0C53.5521 0 32.4001 18.5245 28.2825 42.8504H10.2803C10.1052 42.8504 9.93717 42.7808 9.8133 42.6568C9.68944 42.5328 9.61985 42.3646 9.61985 42.1893V39.252C9.61976 39.0796 9.56863 38.9111 9.47292 38.7677C9.37721 38.6244 9.24121 38.5126 9.08209 38.4466C8.92297 38.3806 8.74788 38.3632 8.57891 38.3967C8.40994 38.4302 8.25468 38.5131 8.13273 38.6348L0.00111321 46.7752C-0.081421 46.8575 -0.146908 46.9553 -0.191592 47.063C-0.236276 47.1707 -0.259277 47.2862 -0.259277 47.4028C-0.259277 47.5194 -0.236276 47.6349 -0.191592 47.7426C-0.146908 47.8503 -0.081421 47.9481 0.00111321 48.0305L8.08152 56.1185C8.20745 56.2448 8.36796 56.3308 8.54274 56.3657C8.71752 56.4006 8.89871 56.3828 9.0634 56.3146C9.22809 56.2464 9.36886 56.1309 9.46791 55.9826C9.56697 55.8342 9.61984 55.6599 9.61985 55.4815V52.6163C9.61985 52.5295 9.63694 52.4436 9.67013 52.3633C9.70332 52.2831 9.75197 52.2103 9.8133 52.1489C9.87463 52.0875 9.94744 52.0388 10.0276 52.0056C10.1077 51.9723 10.1936 51.9552 10.2803 51.9552H32.5725C32.6239 51.9548 32.6751 51.9485 32.7251 51.9364H37.5324C37.5324 51.7973 37.5324 51.6582 37.5324 51.518C37.5324 28.5791 56.1094 9.98978 79.0213 9.98978C101.933 9.98978 120.515 28.5844 120.515 51.5232C120.515 74.4621 101.938 93.0514 79.0213 93.0514C57.8829 93.0514 40.4366 77.231 37.8564 56.7733H27.8206C30.451 82.7593 52.3722 103.036 79.0265 103.036C107.452 103.036 130.497 79.9706 130.497 51.5169C130.497 23.0633 107.453 0 79.0265 0Z"
            fill="url(#paint0_linear_0_1)"/>
          <path
            d="M73.2724 30.1971C73.2724 28.8187 73.8279 27.4968 74.8167 26.5222C75.8054 25.5475 77.1465 25 78.5448 25C79.9432 25 81.2842 25.5475 82.273 26.5222C83.2618 27.4968 83.8172 28.8187 83.8172 30.1971C83.8172 31.5755 83.2618 32.8974 82.273 33.872C81.2842 34.8466 79.9432 35.3942 78.5448 35.3942C77.1465 35.3942 75.8054 34.8466 74.8167 33.872C73.8279 32.8974 73.2724 31.5755 73.2724 30.1971ZM68 45.7884C68 43.872 69.5707 42.3237 71.5149 42.3237H78.5448C80.489 42.3237 82.0598 43.872 82.0598 45.7884V70.0415H85.5747C87.5189 70.0415 89.0897 71.5898 89.0897 73.5062C89.0897 75.4227 87.5189 76.971 85.5747 76.971H71.5149C69.5707 76.971 68 75.4227 68 73.5062C68 71.5898 69.5707 70.0415 71.5149 70.0415H75.0299V49.2531H71.5149C69.5707 49.2531 68 47.7048 68 45.7884Z"
            fill="url(#paint1_linear_0_1)"/>
          <defs>
            <linearGradient id="paint0_linear_0_1" x1="65.1188" y1="0" x2="65.1188" y2="103.036"
                            gradientUnits="userSpaceOnUse">
              <stop stop-color="#1F9F62"/>
              <stop offset="1" stop-color="#022739"/>
            </linearGradient>
            <linearGradient id="paint1_linear_0_1" x1="78.5448" y1="25" x2="78.5448" y2="76.971"
                            gradientUnits="userSpaceOnUse">
              <stop stop-color="#36BFA1"/>
              <stop offset="1" stop-color="#013256"/>
            </linearGradient>
          </defs>
        </svg>

        <h4 ref="infosTitle"> {{domin ? "حوزه عارضه یابی" : "اطلاعات شرکت"}} </h4>
      </li>
      <li class="" ref="complication" @click="router.push('/questions')">
        <svg width="161" height="133" viewBox="0 0 161 133" fill="none"
             xmlns="http://www.w3.org/2000/svg">
          <path
            d="M79.0265 0C53.5521 0 32.4001 18.5245 28.2825 42.8504H10.2803C10.1052 42.8504 9.93717 42.7808 9.8133 42.6568C9.68944 42.5328 9.61985 42.3646 9.61985 42.1893V39.252C9.61976 39.0796 9.56863 38.9111 9.47292 38.7677C9.37721 38.6244 9.24121 38.5126 9.08209 38.4466C8.92297 38.3806 8.74788 38.3632 8.57891 38.3967C8.40994 38.4302 8.25468 38.5131 8.13273 38.6348L0.00111321 46.7752C-0.081421 46.8575 -0.146908 46.9553 -0.191592 47.063C-0.236276 47.1707 -0.259277 47.2862 -0.259277 47.4028C-0.259277 47.5194 -0.236276 47.6349 -0.191592 47.7426C-0.146908 47.8503 -0.081421 47.9481 0.00111321 48.0305L8.08152 56.1185C8.20745 56.2448 8.36796 56.3308 8.54274 56.3657C8.71752 56.4006 8.89871 56.3828 9.0634 56.3146C9.22809 56.2464 9.36886 56.1309 9.46791 55.9826C9.56697 55.8342 9.61984 55.6599 9.61985 55.4815V52.6163C9.61985 52.5295 9.63694 52.4436 9.67013 52.3633C9.70332 52.2831 9.75197 52.2103 9.8133 52.1489C9.87463 52.0875 9.94744 52.0388 10.0276 52.0056C10.1077 51.9723 10.1936 51.9552 10.2803 51.9552H32.5725C32.6239 51.9548 32.6751 51.9485 32.7251 51.9364H37.5324C37.5324 51.7973 37.5324 51.6582 37.5324 51.518C37.5324 28.5791 56.1094 9.98978 79.0213 9.98978C101.933 9.98978 120.515 28.5844 120.515 51.5232C120.515 74.4621 101.938 93.0514 79.0213 93.0514C57.8829 93.0514 40.4366 77.231 37.8564 56.7733H27.8206C30.451 82.7593 52.3722 103.036 79.0265 103.036C107.452 103.036 130.497 79.9706 130.497 51.5169C130.497 23.0633 107.453 0 79.0265 0Z"
            fill="url(#paint0_linear_0_1)"/>
          <path
            d="M79.4164 78.8331C72.1451 78.8331 65.1716 75.9446 60.03 70.803C54.8884 65.6614 51.9999 58.6879 51.9999 51.4166C51.9999 44.1452 54.8884 37.1717 60.03 32.0301C65.1716 26.8885 72.1451 24 79.4164 24C86.6878 24 93.6613 26.8885 98.8029 32.0301C103.944 37.1717 106.833 44.1452 106.833 51.4166C106.833 58.6879 103.944 65.6614 98.8029 70.803C93.6613 75.9446 86.6878 78.8331 79.4164 78.8331ZM88.6481 41.703C87.8021 39.3147 85.5316 37.7083 82.9934 37.7083H76.7498C73.0121 37.7083 69.992 40.7391 69.992 44.466C69.992 46.8864 71.2879 49.1247 73.3869 50.3349L76.8461 52.3162C76.8676 53.7084 78.0135 54.8436 79.4164 54.8436C80.8408 54.8436 81.9867 53.6977 81.9867 52.2733V50.8275C81.9867 49.9065 81.4941 49.0605 80.6909 48.5999L75.9465 45.8797C75.4432 45.5905 75.1326 45.0551 75.1326 44.4767C75.1326 43.5771 75.8609 42.8596 76.7498 42.8596H82.9934C83.3576 42.8596 83.6789 43.0845 83.7967 43.4272L83.8395 43.5557C84.3107 44.8944 85.7887 45.5905 87.1166 45.1193C88.4446 44.6481 89.1515 43.1702 88.6802 41.8422L88.6374 41.7137L88.6481 41.703ZM82.8435 61.6978C82.8435 60.7889 82.4824 59.9172 81.8397 59.2745C81.197 58.6318 80.3254 58.2707 79.4164 58.2707C78.5075 58.2707 77.6358 58.6318 76.9931 59.2745C76.3504 59.9172 75.9894 60.7889 75.9894 61.6978C75.9894 62.6067 76.3504 63.4784 76.9931 64.1211C77.6358 64.7638 78.5075 65.1248 79.4164 65.1248C80.3254 65.1248 81.197 64.7638 81.8397 64.1211C82.4824 63.4784 82.8435 62.6067 82.8435 61.6978Z"
            fill="url(#paint1_linear_0_1)"/>
          <defs>
            <linearGradient id="paint0_linear_0_1" x1="65.1188" y1="0" x2="65.1188" y2="103.036"
                            gradientUnits="userSpaceOnUse">
              <stop stop-color="#1F9F62"/>
              <stop offset="1" stop-color="#022739"/>
            </linearGradient>
            <linearGradient id="paint1_linear_0_1" x1="79.4164" y1="24" x2="79.4164" y2="78.8331"
                            gradientUnits="userSpaceOnUse">
              <stop stop-color="#3AC4AD"/>
              <stop offset="1" stop-color="#023861"/>
            </linearGradient>
          </defs>
        </svg>

        <h4 ref="complicationTitle">سوالات عارضه یابی</h4>
      </li>
      <li class="" ref="credits" @click="router.push('/PayPage')">
        <svg width="161" height="133" viewBox="0 0 161 133" fill="none"
             xmlns="http://www.w3.org/2000/svg">
          <path
            d="M79.0265 0C53.5521 0 32.4001 18.5245 28.2825 42.8504H10.2803C10.1052 42.8504 9.93717 42.7808 9.8133 42.6568C9.68944 42.5328 9.61985 42.3646 9.61985 42.1893V39.252C9.61976 39.0796 9.56863 38.9111 9.47292 38.7677C9.37721 38.6244 9.24121 38.5126 9.08209 38.4466C8.92297 38.3806 8.74788 38.3632 8.57891 38.3967C8.40994 38.4302 8.25468 38.5131 8.13273 38.6348L0.00111321 46.7752C-0.081421 46.8575 -0.146908 46.9553 -0.191592 47.063C-0.236276 47.1707 -0.259277 47.2862 -0.259277 47.4028C-0.259277 47.5194 -0.236276 47.6349 -0.191592 47.7426C-0.146908 47.8503 -0.081421 47.9481 0.00111321 48.0305L8.08152 56.1185C8.20745 56.2448 8.36796 56.3308 8.54274 56.3657C8.71752 56.4006 8.89871 56.3828 9.0634 56.3146C9.22809 56.2464 9.36886 56.1309 9.46791 55.9826C9.56697 55.8342 9.61984 55.6599 9.61985 55.4815V52.6163C9.61985 52.5295 9.63694 52.4436 9.67013 52.3633C9.70332 52.2831 9.75197 52.2103 9.8133 52.1489C9.87463 52.0875 9.94744 52.0388 10.0276 52.0056C10.1077 51.9723 10.1936 51.9552 10.2803 51.9552H32.5725C32.6239 51.9548 32.6751 51.9485 32.7251 51.9364H37.5324C37.5324 51.7973 37.5324 51.6582 37.5324 51.518C37.5324 28.5791 56.1094 9.98978 79.0213 9.98978C101.933 9.98978 120.515 28.5844 120.515 51.5232C120.515 74.4621 101.938 93.0514 79.0213 93.0514C57.8829 93.0514 40.4366 77.231 37.8564 56.7733H27.8206C30.451 82.7593 52.3722 103.036 79.0265 103.036C107.452 103.036 130.497 79.9706 130.497 51.5169C130.497 23.0633 107.453 0 79.0265 0Z"
            fill="url(#paint0_linear_0_1)"/>
          <path
            d="M57.9587 31C54.6721 31 52 33.6683 52 36.9503V39.9254H105.628V36.9503C105.628 33.6683 102.956 31 99.6693 31H57.9587ZM105.628 48.8509H52V66.7018C52 69.9838 54.6721 72.6521 57.9587 72.6521H99.6693C102.956 72.6521 105.628 69.9838 105.628 66.7018V48.8509ZM62.4277 60.7515H68.3863C69.2057 60.7515 69.876 61.4209 69.876 62.2391C69.876 63.0572 69.2057 63.7266 68.3863 63.7266H62.4277C61.6084 63.7266 60.938 63.0572 60.938 62.2391C60.938 61.4209 61.6084 60.7515 62.4277 60.7515ZM72.8553 62.2391C72.8553 61.4209 73.5257 60.7515 74.345 60.7515H86.2623C87.0817 60.7515 87.752 61.4209 87.752 62.2391C87.752 63.0572 87.0817 63.7266 86.2623 63.7266H74.345C73.5257 63.7266 72.8553 63.0572 72.8553 62.2391Z"
            fill="url(#paint1_linear_0_1)"/>
          <defs>
            <linearGradient id="paint0_linear_0_1" x1="65.1188" y1="0" x2="65.1188" y2="103.036"
                            gradientUnits="userSpaceOnUse">
              <stop stop-color="#1F9F62"/>
              <stop offset="1" stop-color="#022739"/>
            </linearGradient>
            <linearGradient id="paint1_linear_0_1" x1="78.814" y1="31" x2="78.814" y2="72.6521"
                            gradientUnits="userSpaceOnUse">
              <stop stop-color="#3AC7BE"/>
              <stop offset="1" stop-color="#013D6C"/>
            </linearGradient>
          </defs>
        </svg>

        <h4 ref="creditsTitle">پرداخت</h4>
      </li>
      <li class="" ref="result" @click="router.push('/result')">
        <svg width="161" height="133" viewBox="0 0 161 133" fill="none"
             xmlns="http://www.w3.org/2000/svg">
          <path
            d="M78.9165 101.833C107.037 101.833 129.833 79.0369 129.833 50.9165C129.833 22.7961 107.037 0 78.9165 0C50.7961 0 28 22.7961 28 50.9165C28 79.0369 50.7961 101.833 78.9165 101.833Z"
            fill="url(#paint0_linear_0_1)"/>
          <g filter="url(#filter0_d_0_1)">
            <path
              d="M79.0049 92.5975C101.728 92.5975 120.149 74.1592 120.149 51.4145C120.149 28.6697 101.728 10.2314 79.0049 10.2314C56.2817 10.2314 37.8608 28.6697 37.8608 51.4145C37.8608 74.1592 56.2817 92.5975 79.0049 92.5975Z"
              fill="white"/>
          </g>
          <path
            d="M61.2307 27C57.2425 27 54 30.2425 54 34.2307V70.3845C54 74.3727 57.2425 77.6152 61.2307 77.6152H97.3845C101.373 77.6152 104.615 74.3727 104.615 70.3845V34.2307C104.615 30.2425 101.373 27 97.3845 27H61.2307ZM68.4615 48.6922C70.4612 48.6922 72.0769 50.3078 72.0769 52.3076V63.1537C72.0769 65.1535 70.4612 66.7691 68.4615 66.7691C66.4617 66.7691 64.8461 65.1535 64.8461 63.1537V52.3076C64.8461 50.3078 66.4617 48.6922 68.4615 48.6922ZM75.6922 41.4615C75.6922 39.4617 77.3078 37.8461 79.3076 37.8461C81.3073 37.8461 82.923 39.4617 82.923 41.4615V63.1537C82.923 65.1535 81.3073 66.7691 79.3076 66.7691C77.3078 66.7691 75.6922 65.1535 75.6922 63.1537V41.4615ZM90.1537 55.923C92.1535 55.923 93.7691 57.5386 93.7691 59.5383V63.1537C93.7691 65.1535 92.1535 66.7691 90.1537 66.7691C88.154 66.7691 86.5383 65.1535 86.5383 63.1537V59.5383C86.5383 57.5386 88.154 55.923 90.1537 55.923Z"
            fill="url(#paint1_linear_0_1)"/>
          <defs>
            <filter id="filter0_d_0_1" x="-2.13916" y="-29.7686" width="162.288" height="162.366"
                    filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
              <feFlood flood-opacity="0" result="BackgroundImageFix"/>
              <feColorMatrix in="SourceAlpha" type="matrix"
                             values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha"/>
              <feOffset/>
              <feGaussianBlur stdDeviation="20"/>
              <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"/>
              <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_0_1"/>
              <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_0_1"
                       result="shape"/>
            </filter>
            <linearGradient id="paint0_linear_0_1" x1="78.9165" y1="0" x2="78.9165" y2="101.833"
                            gradientUnits="userSpaceOnUse">
              <stop stop-color="#2EC2CC"/>
              <stop offset="1" stop-color="#004181"/>
            </linearGradient>
            <linearGradient id="paint1_linear_0_1" x1="79.3076" y1="27" x2="79.3076" y2="77.6152"
                            gradientUnits="userSpaceOnUse">
              <stop stop-color="#2EC2CC"/>
              <stop offset="1" stop-color="#004181"/>
            </linearGradient>
          </defs>
        </svg>

        <h4 ref="resultTitle">گزارش نهایی</h4>
      </li>
    </ul>
  </div>
</template>

<style scoped>
.main {
  width: 70%;
  height: auto;
  display: flex;
  justify-content: center;
  align-items: center;
  background-color: white;
  border-radius: 0;
  border-bottom-right-radius: 60px;
  border-bottom-left-radius: 60px;
  padding: 0;
  top: 8vh;
  position: fixed;
  box-shadow: 0 0 rgba(0, 0, 0, 0);
}

.main ul {
  display: flex;
  justify-content: center;
  list-style: none;
  padding: 0;
}

.main ul li {
  width: 12%;
  height: 15vh;
  display: flex;
  flex-direction: column;
  justify-content: center;
  align-items: center;
  padding: 0;
  opacity: 0.5;
}

.main ul li .link {
  text-decoration: none;
  color: black;
  display: flex;
  flex-direction: column;
  justify-content: center;
  align-items: center;
}

.main ul .now {
  opacity: 1;
}

.main ul .passed {
  opacity: 1;
}

@media screen and (max-width: 480px) {
  .main {
    width: 90%;
  }
}

@media screen and (max-width: 992px) {
  .main {
    width: 90%;
  }
}
</style>
