<script setup>
</script>

<template>
  <div class="main">
    <h3>سلام</h3>
    <h4>به پلتفرم عارضه یاب شرکت دانش بنیان شبکه نوآوری آرمانی خوش اومدین</h4>
    <p class="foreword">
      موفقیت سازمان در دستیابی به اهداف خود به عوامل متعددی بستگی دارد. باتوجه به پویایی حاصل از
      سرعت رشد علم و تکنولوژی در محیط کسب و کار ، سازمان‌ها برای سنجش عملکرد و آگاهی از جایگاه خود
      در بازار، باید بصورت پیوسته بر اساس سیستم‌های کنترلی، خود را مورد ارزیابی قرار دهند. در درسترس
      بودن شبکه‌های مجازی، گستردگی بستر تبلیغات، فراهم بودن امکانات آموزشی و ... سطح آگاهی و
      انتظارات مشتریان‌را افزایش داده‌است. باتوجه به رقابتی‌بودن فضای بازار، در صورت عدم شناسایی
      نقاط ضعف در زمان مناسب و برنامه‌ریزی برای برطرف نمودن آن‌ها، محصولات و خدمات رقبا جایگزین
      محصولات شرکت شده و با از دست‌رفتن اعتماد مشتریان، شرکت با کاهش سهم بازار و در نتیجه کاهش درآمد
      رو به رو خواهدشد. در این حالت بقای شرکت در بازار رقابتی از هر زمان دیگری سخت‌تر شده و خطر
      ورشکستگی بیش از پیش سازمان‌را تهدید خواهدکرد.
      <br>
      شرکت‌ها برای هماهنگی با نیازهای متغیر مشتریان، می‌بایست با تعریف پروژه‌های جدید و یا مهندسی
      مجدد فرآیندها، خدمات و محصولات جدید را با حداقل نقاط ضعف ارائه دهند. بدین منظور شرکت نیازمند
      ارزیابی آمادگی خود برای اجرای تغییرات می‌باشد. انجام یک ارزیابی آمادگی پدید آورنده‌ی این دانش
      و اطمینان است که آیا تلاش‌های شرکت برای انجام یک پروژه کاری خاص موفقیت‌آمیز خواهدبود یا خیر.
      ارزیابی سازمانی از یک شکست بالقوه شرکت در پروژه‌ای که آماده تکمیل آن نبوده است جلوگیری کرده و
      از این راه به حفظ اعتبار شرکت شما کمک می‌کند. انجام یک ارزیابی کلی سازمانی بخشی از برنامه‌ریزی
      استراتژیک می‌باشد. بررسی نقاط قوت و ضعف داخلی و همچنین تهدیدها و فرصت های بیرونی قبل از بررسی
      دقیق ماموریت و چشم انداز و اهداف آینده ضروری است.
      <br>
      شرکت دانش بنیان شبکه نوآوری و فناوری آرمانی صبا با هدف ارائه خدمات به شرکت های دانش بنیان ،
      فناور و خلاق
      زیست بوم فناوری کشور، با استفاده از کارشناسان حوزه کسب و کار، با طراحی الگوی ارزیابی
      منحصربه‌فرد و تخصصی، در بهبود و توسعه شرکت‌ شما در کنارتان خواهد بود.
    </p>
    <RouterLink class="saveAndNext" to="/SignIn">
        شروع عارضه یابی
    </RouterLink>
  </div>
</template>

<style scoped>
.main {
  width: 70%;
  min-width: 300px;
}

.main p {
  text-align: justify;
  z-index: 100;
}

.main h4, .main h3 {
  margin: 0;
}

@media screen and (max-width: 1279px) {
  .main {
    width: 95%;
  }
}

@media screen and (max-width: 768px) {
  .main {
    width: 100%;
  }
}
</style>
